Revit 2027 API
Rebar.GetTerminationRotationAngle Method
 Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetTerminationRotationAngle(
	int end
)
Public Function GetTerminationRotationAngle (
	end As Integer
) As Double
public:
double GetTerminationRotationAngle(
	int end
)
member GetTerminationRotationAngle :
        end : int -> float
Parameters
end Int32
 0 for the start, 1 for the end.
Return Value
Double
 Returns the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace